{
    "presentation": "Explora mis proyectos destacados, las competencias que he adquirido y los logros importantes que reflejan mi compromiso y pasión por mi profesión.",
    "hello": "Yo soy ",
    "last": "Últimos proyectos:",
    "nav": {
        "home": "Inicio",
        "services": "Servicios",
        "projects": "Proyectos",
        "skills": "Habilidades"
    },
    "about": {
        "title": "Sobre mí",
        "description1": "Desde niño, la tecnología ha sido mi pasión. Mis primeros encuentros con computadoras y la fascinación por cómo funcionaban los programas me guiaron hacia la computación.",
        "description2": "Con el tiempo, mi interés creció y comencé a explorar",
        "description3": "Pasaba horas desmantelando y ensamblando computadoras, entendiendo el propósito de cada componente.",
        "description4": "Esta pasión me llevó a estudiar",
        "description5": "en el Instituto de {{0}}. He trabajado en diversos proyectos, aplicando y ampliando mis conocimientos. Cada proyecto es un nuevo desafío y una oportunidad para crecer personal y profesionalmente.",
        "description6": "Espero seguir desarrollando mi carrera, adquiriendo nuevas habilidades y contribuyendo con mi conocimiento y experiencia.",
        "span1": " la arquitectura, los detalles técnicos y la configuración de hardware.",
        "span2": " programación y creación de software "
    },
    "footer": {
        "1": "Disponible para trabajar, conectemos.",
        "2": "Encontrame en las redes:"
    },
    "contact": {
        "title": "Contacto",
        "name": "Nombre:",
        "message": "Mensaje:",
        "buttonSend": "Enviar",
        "userInput": {
            "name": "Ingrese su nombre",
            "email": "Ingrese su email",
            "message": "Ingrese su mensaje"
        },
        "description": {
            "address": "DIRECCIÓN",
            "presentation": "Puedes contactarme enviando un mail o a través de mis redes sociales. ¡Espero tu mensaje!"
        },
        "successfully": "Enviado exitosamente!",
        "failed": "No se pudo enviar el correo electrónico.",
        "error": "Error al enviar el correo electrónico.",
        "sending": "Enviando..."
    },
    "servicesprofile": {
        "desing": "Dieño",
        "desingdescription": "Me especializo en diseñar software intuitivo y atractivo, desde la concepción inicial hasta el producto final. Utilizo métodos ágiles para iterar rápidamente y ajustar el diseño según el feedback de los usuarios, asegurando que cumpla con altos estándares de calidad y sus necesidades.",
        "development": "Desarrollo",
        "developmentdescription": "En el desarrollo aseguro la robustez y escalabilidad del sistema. Colaboro estrechamente con equipos utilizando metodologías para adaptar rápidamente el producto a medida que evoluciona, garantizando soluciones que no solo funcionen bien, sino que también sean fáciles de mantener.",
        "maintenance": "Mantenimiento",
        "maintenancedescription": "En el mantenimiento de software, garantizo sistemas eficientes ysin problemas. Detecto y corrijo problemas antes de que afecten a los usuarios, implemento actualizaciones cuidadosamente para mantener un funcionamiento seguro y continuo, adaptándome a nuevas necesidades según surjan."
    },
    "skills": {
        "1": "Poseo sólidos conocimientos y experiencia en desarrollo de software, destacado en la creación de aplicaciones innovadoras y eficientes. Mi destreza incluye programación en varios lenguajes y resolución de problemas.",
        "2": "Estoy encantado de tener la oportunidad de discutir cómo mis habilidades y experiencia que puedan contribuir al éxito de sus proyecto.",
        "3": "Siempre estoy en la búsqueda de mejorar mis habilidades y la adaptación constante a las nuevas tendencias y tecnologías del campo."
    },
    "workprojects": [
        {
            "title": "Bebidas Cocktail",
            "description": "Una aplicación web que permite a los usuarios explorar y ver recetas  de tragos de diferentes tipos, desarrollado con  React y TypeScript.",
            "img": "cocktail",
            "url": "https://bebidas-react-typescript-lyart.vercel.app/",
            "github": "https://github.com/javierh-castro/bebidas-react-typescript",
            "skill": "React, Tailwindcss, Zod"
        },
        {
            "title": "Estado del Tiempo",
            "description": "Consulta el tiempo de cualquier ciudad con esta aplicación construida con React y TypeScript. Este proyecto también se utilizo Zod para validación y esquema de datos.",
            "img": "buscarclima",
            "url": "https://cheery-cat-44c418.netlify.app/",
            "github": "https://github.com/javierh-castro/clima-react",
            "skill": "Typescript, Next, Zod"
        },
        {
            "title": "Recipify",
            "description": "Recipify es desarrollado junto a compañeros para la asignatura de programación. La web permite registrarse, buscar recetas de cocina y publicar las recetas, tiene integrado nextauth, JWT, roles y verificación.",
            "img": "recipify",
            "url": "https://github.com/javierh-castro/proyect-recipify",
            "github": "https://github.com/javierh-castro/proyect-recipify",
            "skill": "Typescript, Next, Tailwindcss"
        },
        {
            "title": "Tic Tac Toe",
            "description": "Juego de Tic Tac Toe desarrollado con React, se utiliza en proyecto React Context Provider para la gestión del estado.",
            "img": "tic tac toe",
            "url": "https://javierh-castro.github.io/tic-tac-toe/",
            "github": "https://github.com/javierh-castro/tic-tac-toe",
            "skill": "React, Css"
        },
        {
            "title": "Control Financiero",
            "description": "Organiza el balance financiero y genera un registro detallado de gastos e ingresos.",
            "img": "income expenses",
            "url": "https://income-expenses-example.netlify.app/",
            "github": "https://github.com/javierh-castro/Income-and-Expenses",
            "skill": "React, Tailwindcss"
        },
        {
            "title": "E-commerce web",
            "img": "commerce",
            "description": "Mi primer e-commerce cuenta con un filtro por precio y categoría, y dispone de un carrito de compras.",
            "url": "https://ecommerce-javier.netlify.app/",
            "github": "https://github.com/javierh-castro/proyect-ecommerce/tree/master",
            "skill": "React, Css"
        },
        {
            "title": "Crud Users",
            "description": "Un CRUD que muestra detalles de los usuarios y se integra con una base de datos.",
            "img": "crud 2",
            "url": "https://github.com/javierh-castro/CRUD-2",
            "github": "https://github.com/javierh-castro/CRUD-2",
            "skill": "Node, Typescript"
        }
    ]
}